package repository;

public class ShopsRepository {


    /* Написать методы, принимающие запросы с сервиса и отправляющие данные обратно
    * К примеру select:
    *   public _ selectFromShop(список столбцов либо "*", условие)
    *   Условие может быть, а может и не быть, если его нет - оно null. Если есть, это
    *   либо строка, либо словарь, я еще не выбрал, но думаю про словарь
    *
    *   вернуть надо список объектов. Если просят определенные поля, то у этих объектов значения должны быть только
    *   в тех полях, которые надо. Остальные - null
    *
    * Ну и еще insert:
    *   public _ insertIntoShop(объект класса Shop, с соответствующими полями)
    *
    *
    *
    * */
}
